In [8]:
import pandas as pd

frame=pd.DataFrame({'number':range(10),'chars':['a']*10})

In [10]:
frame

  chars  number
0     a       0
1     a       1
2     a       2
3     a       3
4     a       4
5     a       5
6     a       6
7     a       7
8     a       8
9     a       9

In [22]:
frame=pd.read_csv('dataset.tsv',header=0,sep='\t')

In [24]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [26]:
frame.columns

Index([u'Name', u'Birth', u'City', u'Position'], dtype='object')

In [30]:
y=frame.shape
print type(y)

<type 'tuple'>

In [32]:
new_line={'Name':'Petrov','Birth':'21.02.1989','City':'Moscow'}

In [35]:
frame.append(new_line,ignore_index=True)

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6           Petrov  21.02.1989     Moscow       NaN

In [40]:
frame['Employee']='Yes'

In [42]:
frame

              Name       Birth       City  Position Employee
0      Иванов А.А.  22.03.1980     Москва       NaN      Yes
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      Yes
2       Белов М.М.  13.02.1980     Ростов  менеджер      Yes
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      Yes
4      Рыбина Е.П.  19.11.1985     Москва   инженер      Yes
5     Костров С.О.  31.05.1985     Москва    стажер      Yes

In [51]:
#frame.drop([0],axis=0,inplace=True)
frame

              Name       Birth       City  Position Employee
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      Yes
2       Белов М.М.  13.02.1980     Ростов  менеджер      Yes
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      Yes
4      Рыбина Е.П.  19.11.1985     Москва   инженер      Yes
5     Костров С.О.  31.05.1985     Москва    стажер      Yes

In [54]:
frame.drop('Employee',axis=1)
frame

              Name       Birth       City  Position Employee
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      Yes
2       Белов М.М.  13.02.1980     Ростов  менеджер      Yes
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      Yes
4      Рыбина Е.П.  19.11.1985     Москва   инженер      Yes
5     Костров С.О.  31.05.1985     Москва    стажер      Yes

In [55]:
frame.to_csv('1111.csv',sep=',',header=True,index=False)

In [56]:
!cat 1111.csv

Name,Birth,City,Position,Employee
Сорокин И.В.,07.08.1965,Волгоград,инженер,Yes
Белов М.М.,13.02.1980,Ростов,менеджер,Yes
Мельникова Д.С.,15.04.1985,Ростов,,Yes
Рыбина Е.П.,19.11.1985,Москва,инженер,Yes
Костров С.О.,31.05.1985,Москва,стажер,Yes